package com.tc.common.http;

import lombok.Getter;

/**
 * Author jiangzhou
 * Date 2023/10/9
 * Description 错误码枚举
 **/

@Getter
public enum ErrorCode {

    //SUCCESS
    E2001(2001, "密码过期"),
    E2002(2002, "Token失效"),

    //ERROR
    E3000(3000, "用户名密码错误"),
    E3002(3002, "Token未携带"),
    E3003(3003, "登录锁定"),
    E3004(3004, "非常用设备"),
    E3005(3005, "图片上传失败"),
    E3006(3006, "用户不存在"),
    E3007(3007, "系统角色"),
    E3008(3008, "验证码过期"),
    E3009(3009, "验证码不匹配"),
    E3010(3010, "用户名重复"),
    E3011(3011, "密码错误"),
    E3012(3012, "角色下还关联用户"),
    E3013(3013, "用户不存在"),
    E3014(3014, "组织编码重复"),
    E3015(3015, "角色名重复"),
    E3016(3016, "已关联变电站，请删除变电站后，再操作"),
    E3017(3017, "已关联视频主机，请删除视频主机后，再操作"),
    E3018(3018, "已关联机器人主机，请删除机器人主机后，再操作"),
    E3019(3019, "已关联无人机主机，请删除无人机主机后，再操作"),
    E3020(3020, "IP重复"),
    E3021(3021, "该摄像机已关联其它机器人或无人机"),

    E3022(3022, "未找到设备信息!"),
    ;


    final int code;
    final String message;

    ErrorCode(int code, String message) {
        this.code = code;
        this.message = message;
    }
}
